RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_uart.h
/* Bit fields for UART IFC */
#define _UART_IFC_RESETVALUE                   0x00000000UL                     /**< Default value for UART_IFC */
#define _UART_IFC_MASK                         0x0001FFF9UL                     /**< Mask for UART_IFC */
#define UART_IFC_TXC                           (0x1UL << 0)                     /**< Clear TXC Interrupt Flag */
#define _UART_IFC_TXC_SHIFT                    0                                /**< Shift value for USART_TXC */
#define _UART_IFC_TXC_MASK                     0x1UL                            /**< Bit mask for USART_TXC */
#define _UART_IFC_TXC_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TXC_DEFAULT                   (_UART_IFC_TXC_DEFAULT << 0)     /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_RXFULL                        (0x1UL << 3)                     /**< Clear RXFULL Interrupt Flag */
#define _UART_IFC_RXFULL_SHIFT                 3                                /**< Shift value for USART_RXFULL */
#define _UART_IFC_RXFULL_MASK                  0x8UL                            /**< Bit mask for USART_RXFULL */
#define _UART_IFC_RXFULL_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_RXFULL_DEFAULT                (_UART_IFC_RXFULL_DEFAULT << 3)  /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_RXOF                          (0x1UL << 4)                     /**< Clear RXOF Interrupt Flag */
#define _UART_IFC_RXOF_SHIFT                   4                                /**< Shift value for USART_RXOF */
#define _UART_IFC_RXOF_MASK                    0x10UL                           /**< Bit mask for USART_RXOF */
#define _UART_IFC_RXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_RXOF_DEFAULT                  (_UART_IFC_RXOF_DEFAULT << 4)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_RXUF                          (0x1UL << 5)                     /**< Clear RXUF Interrupt Flag */
#define _UART_IFC_RXUF_SHIFT                   5                                /**< Shift value for USART_RXUF */
#define _UART_IFC_RXUF_MASK                    0x20UL                           /**< Bit mask for USART_RXUF */
#define _UART_IFC_RXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_RXUF_DEFAULT                  (_UART_IFC_RXUF_DEFAULT << 5)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TXOF                          (0x1UL << 6)                     /**< Clear TXOF Interrupt Flag */
#define _UART_IFC_TXOF_SHIFT                   6                                /**< Shift value for USART_TXOF */
#define _UART_IFC_TXOF_MASK                    0x40UL                           /**< Bit mask for USART_TXOF */
#define _UART_IFC_TXOF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TXOF_DEFAULT                  (_UART_IFC_TXOF_DEFAULT << 6)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TXUF                          (0x1UL << 7)                     /**< Clear TXUF Interrupt Flag */
#define _UART_IFC_TXUF_SHIFT                   7                                /**< Shift value for USART_TXUF */
#define _UART_IFC_TXUF_MASK                    0x80UL                           /**< Bit mask for USART_TXUF */
#define _UART_IFC_TXUF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TXUF_DEFAULT                  (_UART_IFC_TXUF_DEFAULT << 7)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_PERR                          (0x1UL << 8)                     /**< Clear PERR Interrupt Flag */
#define _UART_IFC_PERR_SHIFT                   8                                /**< Shift value for USART_PERR */
#define _UART_IFC_PERR_MASK                    0x100UL                          /**< Bit mask for USART_PERR */
#define _UART_IFC_PERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_PERR_DEFAULT                  (_UART_IFC_PERR_DEFAULT << 8)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_FERR                          (0x1UL << 9)                     /**< Clear FERR Interrupt Flag */
#define _UART_IFC_FERR_SHIFT                   9                                /**< Shift value for USART_FERR */
#define _UART_IFC_FERR_MASK                    0x200UL                          /**< Bit mask for USART_FERR */
#define _UART_IFC_FERR_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_FERR_DEFAULT                  (_UART_IFC_FERR_DEFAULT << 9)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_MPAF                          (0x1UL << 10)                    /**< Clear MPAF Interrupt Flag */
#define _UART_IFC_MPAF_SHIFT                   10                               /**< Shift value for USART_MPAF */
#define _UART_IFC_MPAF_MASK                    0x400UL                          /**< Bit mask for USART_MPAF */
#define _UART_IFC_MPAF_DEFAULT                 0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_MPAF_DEFAULT                  (_UART_IFC_MPAF_DEFAULT << 10)   /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_SSM                           (0x1UL << 11)                    /**< Clear SSM Interrupt Flag */
#define _UART_IFC_SSM_SHIFT                    11                               /**< Shift value for USART_SSM */
#define _UART_IFC_SSM_MASK                     0x800UL                          /**< Bit mask for USART_SSM */
#define _UART_IFC_SSM_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_SSM_DEFAULT                   (_UART_IFC_SSM_DEFAULT << 11)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_CCF                           (0x1UL << 12)                    /**< Clear CCF Interrupt Flag */
#define _UART_IFC_CCF_SHIFT                    12                               /**< Shift value for USART_CCF */
#define _UART_IFC_CCF_MASK                     0x1000UL                         /**< Bit mask for USART_CCF */
#define _UART_IFC_CCF_DEFAULT                  0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_CCF_DEFAULT                   (_UART_IFC_CCF_DEFAULT << 12)    /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TXIDLE                        (0x1UL << 13)                    /**< Clear TXIDLE Interrupt Flag */
#define _UART_IFC_TXIDLE_SHIFT                 13                               /**< Shift value for USART_TXIDLE */
#define _UART_IFC_TXIDLE_MASK                  0x2000UL                         /**< Bit mask for USART_TXIDLE */
#define _UART_IFC_TXIDLE_DEFAULT               0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TXIDLE_DEFAULT                (_UART_IFC_TXIDLE_DEFAULT << 13) /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP0                         (0x1UL << 14)                    /**< Clear TCMP0 Interrupt Flag */
#define _UART_IFC_TCMP0_SHIFT                  14                               /**< Shift value for USART_TCMP0 */
#define _UART_IFC_TCMP0_MASK                   0x4000UL                         /**< Bit mask for USART_TCMP0 */
#define _UART_IFC_TCMP0_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP0_DEFAULT                 (_UART_IFC_TCMP0_DEFAULT << 14)  /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP1                         (0x1UL << 15)                    /**< Clear TCMP1 Interrupt Flag */
#define _UART_IFC_TCMP1_SHIFT                  15                               /**< Shift value for USART_TCMP1 */
#define _UART_IFC_TCMP1_MASK                   0x8000UL                         /**< Bit mask for USART_TCMP1 */
#define _UART_IFC_TCMP1_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP1_DEFAULT                 (_UART_IFC_TCMP1_DEFAULT << 15)  /**< Shifted mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP2                         (0x1UL << 16)                    /**< Clear TCMP2 Interrupt Flag */
#define _UART_IFC_TCMP2_SHIFT                  16                               /**< Shift value for USART_TCMP2 */
#define _UART_IFC_TCMP2_MASK                   0x10000UL                        /**< Bit mask for USART_TCMP2 */
#define _UART_IFC_TCMP2_DEFAULT                0x00000000UL                     /**< Mode DEFAULT for UART_IFC */
#define UART_IFC_TCMP2_DEFAULT                 (_UART_IFC_TCMP2_DEFAULT << 16)  /**< Shifted mode DEFAULT for UART_IFC */

