RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_uart.h
/* Bit fields for UART TIMECMP1 */
#define _UART_TIMECMP1_RESETVALUE              0x00000000UL                             /**< Default value for UART_TIMECMP1 */
#define _UART_TIMECMP1_MASK                    0x017700FFUL                             /**< Mask for UART_TIMECMP1 */
#define _UART_TIMECMP1_TCMPVAL_SHIFT           0                                        /**< Shift value for USART_TCMPVAL */
#define _UART_TIMECMP1_TCMPVAL_MASK            0xFFUL                                   /**< Bit mask for USART_TCMPVAL */
#define _UART_TIMECMP1_TCMPVAL_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP1 */
#define UART_TIMECMP1_TCMPVAL_DEFAULT          (_UART_TIMECMP1_TCMPVAL_DEFAULT << 0)    /**< Shifted mode DEFAULT for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_SHIFT            16                                       /**< Shift value for USART_TSTART */
#define _UART_TIMECMP1_TSTART_MASK             0x70000UL                                /**< Bit mask for USART_TSTART */
#define _UART_TIMECMP1_TSTART_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_DISABLE          0x00000000UL                             /**< Mode DISABLE for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_TXEOF            0x00000001UL                             /**< Mode TXEOF for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_TXC              0x00000002UL                             /**< Mode TXC for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_RXACT            0x00000003UL                             /**< Mode RXACT for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTART_RXEOF            0x00000004UL                             /**< Mode RXEOF for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_DEFAULT           (_UART_TIMECMP1_TSTART_DEFAULT << 16)    /**< Shifted mode DEFAULT for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_DISABLE           (_UART_TIMECMP1_TSTART_DISABLE << 16)    /**< Shifted mode DISABLE for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_TXEOF             (_UART_TIMECMP1_TSTART_TXEOF << 16)      /**< Shifted mode TXEOF for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_TXC               (_UART_TIMECMP1_TSTART_TXC << 16)        /**< Shifted mode TXC for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_RXACT             (_UART_TIMECMP1_TSTART_RXACT << 16)      /**< Shifted mode RXACT for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTART_RXEOF             (_UART_TIMECMP1_TSTART_RXEOF << 16)      /**< Shifted mode RXEOF for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTOP_SHIFT             20                                       /**< Shift value for USART_TSTOP */
#define _UART_TIMECMP1_TSTOP_MASK              0x700000UL                               /**< Bit mask for USART_TSTOP */
#define _UART_TIMECMP1_TSTOP_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTOP_TCMP1             0x00000000UL                             /**< Mode TCMP1 for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTOP_TXST              0x00000001UL                             /**< Mode TXST for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTOP_RXACT             0x00000002UL                             /**< Mode RXACT for UART_TIMECMP1 */
#define _UART_TIMECMP1_TSTOP_RXACTN            0x00000003UL                             /**< Mode RXACTN for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTOP_DEFAULT            (_UART_TIMECMP1_TSTOP_DEFAULT << 20)     /**< Shifted mode DEFAULT for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTOP_TCMP1              (_UART_TIMECMP1_TSTOP_TCMP1 << 20)       /**< Shifted mode TCMP1 for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTOP_TXST               (_UART_TIMECMP1_TSTOP_TXST << 20)        /**< Shifted mode TXST for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTOP_RXACT              (_UART_TIMECMP1_TSTOP_RXACT << 20)       /**< Shifted mode RXACT for UART_TIMECMP1 */
#define UART_TIMECMP1_TSTOP_RXACTN             (_UART_TIMECMP1_TSTOP_RXACTN << 20)      /**< Shifted mode RXACTN for UART_TIMECMP1 */
#define UART_TIMECMP1_RESTARTEN                (0x1UL << 24)                            /**< Restart Timer on TCMP1 */
#define _UART_TIMECMP1_RESTARTEN_SHIFT         24                                       /**< Shift value for USART_RESTARTEN */
#define _UART_TIMECMP1_RESTARTEN_MASK          0x1000000UL                              /**< Bit mask for USART_RESTARTEN */
#define _UART_TIMECMP1_RESTARTEN_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP1 */
#define UART_TIMECMP1_RESTARTEN_DEFAULT        (_UART_TIMECMP1_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for UART_TIMECMP1 */

/* Bit fields for UART TIMECMP2 */
#define _UART_TIMECMP2_RESETVALUE              0x00000000UL                             /**< Default value for UART_TIMECMP2 */
#define _UART_TIMECMP2_MASK                    0x017700FFUL                             /**< Mask for UART_TIMECMP2 */
#define _UART_TIMECMP2_TCMPVAL_SHIFT           0                                        /**< Shift value for USART_TCMPVAL */
#define _UART_TIMECMP2_TCMPVAL_MASK            0xFFUL                                   /**< Bit mask for USART_TCMPVAL */
#define _UART_TIMECMP2_TCMPVAL_DEFAULT         0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP2 */
#define UART_TIMECMP2_TCMPVAL_DEFAULT          (_UART_TIMECMP2_TCMPVAL_DEFAULT << 0)    /**< Shifted mode DEFAULT for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_SHIFT            16                                       /**< Shift value for USART_TSTART */
#define _UART_TIMECMP2_TSTART_MASK             0x70000UL                                /**< Bit mask for USART_TSTART */
#define _UART_TIMECMP2_TSTART_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_DISABLE          0x00000000UL                             /**< Mode DISABLE for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_TXEOF            0x00000001UL                             /**< Mode TXEOF for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_TXC              0x00000002UL                             /**< Mode TXC for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_RXACT            0x00000003UL                             /**< Mode RXACT for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTART_RXEOF            0x00000004UL                             /**< Mode RXEOF for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_DEFAULT           (_UART_TIMECMP2_TSTART_DEFAULT << 16)    /**< Shifted mode DEFAULT for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_DISABLE           (_UART_TIMECMP2_TSTART_DISABLE << 16)    /**< Shifted mode DISABLE for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_TXEOF             (_UART_TIMECMP2_TSTART_TXEOF << 16)      /**< Shifted mode TXEOF for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_TXC               (_UART_TIMECMP2_TSTART_TXC << 16)        /**< Shifted mode TXC for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_RXACT             (_UART_TIMECMP2_TSTART_RXACT << 16)      /**< Shifted mode RXACT for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTART_RXEOF             (_UART_TIMECMP2_TSTART_RXEOF << 16)      /**< Shifted mode RXEOF for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTOP_SHIFT             20                                       /**< Shift value for USART_TSTOP */
#define _UART_TIMECMP2_TSTOP_MASK              0x700000UL                               /**< Bit mask for USART_TSTOP */
#define _UART_TIMECMP2_TSTOP_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTOP_TCMP2             0x00000000UL                             /**< Mode TCMP2 for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTOP_TXST              0x00000001UL                             /**< Mode TXST for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTOP_RXACT             0x00000002UL                             /**< Mode RXACT for UART_TIMECMP2 */
#define _UART_TIMECMP2_TSTOP_RXACTN            0x00000003UL                             /**< Mode RXACTN for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTOP_DEFAULT            (_UART_TIMECMP2_TSTOP_DEFAULT << 20)     /**< Shifted mode DEFAULT for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTOP_TCMP2              (_UART_TIMECMP2_TSTOP_TCMP2 << 20)       /**< Shifted mode TCMP2 for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTOP_TXST               (_UART_TIMECMP2_TSTOP_TXST << 20)        /**< Shifted mode TXST for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTOP_RXACT              (_UART_TIMECMP2_TSTOP_RXACT << 20)       /**< Shifted mode RXACT for UART_TIMECMP2 */
#define UART_TIMECMP2_TSTOP_RXACTN             (_UART_TIMECMP2_TSTOP_RXACTN << 20)      /**< Shifted mode RXACTN for UART_TIMECMP2 */
#define UART_TIMECMP2_RESTARTEN                (0x1UL << 24)                            /**< Restart Timer on TCMP2 */
#define _UART_TIMECMP2_RESTARTEN_SHIFT         24                                       /**< Shift value for USART_RESTARTEN */
#define _UART_TIMECMP2_RESTARTEN_MASK          0x1000000UL                              /**< Bit mask for USART_RESTARTEN */
#define _UART_TIMECMP2_RESTARTEN_DEFAULT       0x00000000UL                             /**< Mode DEFAULT for UART_TIMECMP2 */
#define UART_TIMECMP2_RESTARTEN_DEFAULT        (_UART_TIMECMP2_RESTARTEN_DEFAULT << 24) /**< Shifted mode DEFAULT for UART_TIMECMP2 */

/* Bit fields for UART ROUTEPEN */
#define _UART_ROUTEPEN_RESETVALUE              0x00000000UL                         /**< Default value for UART_ROUTEPEN */
#define _UART_ROUTEPEN_MASK                    0x0000003FUL                         /**< Mask for UART_ROUTEPEN */
#define UART_ROUTEPEN_RXPEN                    (0x1UL << 0)                         /**< RX Pin Enable */
#define _UART_ROUTEPEN_RXPEN_SHIFT             0                                    /**< Shift value for USART_RXPEN */
#define _UART_ROUTEPEN_RXPEN_MASK              0x1UL                                /**< Bit mask for USART_RXPEN */
#define _UART_ROUTEPEN_RXPEN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_RXPEN_DEFAULT            (_UART_ROUTEPEN_RXPEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_TXPEN                    (0x1UL << 1)                         /**< TX Pin Enable */
#define _UART_ROUTEPEN_TXPEN_SHIFT             1                                    /**< Shift value for USART_TXPEN */
#define _UART_ROUTEPEN_TXPEN_MASK              0x2UL                                /**< Bit mask for USART_TXPEN */
#define _UART_ROUTEPEN_TXPEN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_TXPEN_DEFAULT            (_UART_ROUTEPEN_TXPEN_DEFAULT << 1)  /**< Shifted mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CSPEN                    (0x1UL << 2)                         /**< CS Pin Enable */
#define _UART_ROUTEPEN_CSPEN_SHIFT             2                                    /**< Shift value for USART_CSPEN */
#define _UART_ROUTEPEN_CSPEN_MASK              0x4UL                                /**< Bit mask for USART_CSPEN */
#define _UART_ROUTEPEN_CSPEN_DEFAULT           0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CSPEN_DEFAULT            (_UART_ROUTEPEN_CSPEN_DEFAULT << 2)  /**< Shifted mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CLKPEN                   (0x1UL << 3)                         /**< CLK Pin Enable */
#define _UART_ROUTEPEN_CLKPEN_SHIFT            3                                    /**< Shift value for USART_CLKPEN */
#define _UART_ROUTEPEN_CLKPEN_MASK             0x8UL                                /**< Bit mask for USART_CLKPEN */
#define _UART_ROUTEPEN_CLKPEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CLKPEN_DEFAULT           (_UART_ROUTEPEN_CLKPEN_DEFAULT << 3) /**< Shifted mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CTSPEN                   (0x1UL << 4)                         /**< CTS Pin Enable */
#define _UART_ROUTEPEN_CTSPEN_SHIFT            4                                    /**< Shift value for USART_CTSPEN */
#define _UART_ROUTEPEN_CTSPEN_MASK             0x10UL                               /**< Bit mask for USART_CTSPEN */
#define _UART_ROUTEPEN_CTSPEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_CTSPEN_DEFAULT           (_UART_ROUTEPEN_CTSPEN_DEFAULT << 4) /**< Shifted mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_RTSPEN                   (0x1UL << 5)                         /**< RTS Pin Enable */
#define _UART_ROUTEPEN_RTSPEN_SHIFT            5                                    /**< Shift value for USART_RTSPEN */
#define _UART_ROUTEPEN_RTSPEN_MASK             0x20UL                               /**< Bit mask for USART_RTSPEN */
#define _UART_ROUTEPEN_RTSPEN_DEFAULT          0x00000000UL                         /**< Mode DEFAULT for UART_ROUTEPEN */
#define UART_ROUTEPEN_RTSPEN_DEFAULT           (_UART_ROUTEPEN_RTSPEN_DEFAULT << 5) /**< Shifted mode DEFAULT for UART_ROUTEPEN */

/* Bit fields for UART ROUTELOC0 */
#define _UART_ROUTELOC0_RESETVALUE             0x00000000UL                           /**< Default value for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_MASK                   0x07070707UL                           /**< Mask for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_SHIFT            0                                      /**< Shift value for USART_RXLOC */
#define _UART_ROUTELOC0_RXLOC_MASK             0x7UL                                  /**< Bit mask for USART_RXLOC */
#define _UART_ROUTELOC0_RXLOC_LOC0             0x00000000UL                           /**< Mode LOC0 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC1             0x00000001UL                           /**< Mode LOC1 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC2             0x00000002UL                           /**< Mode LOC2 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC3             0x00000003UL                           /**< Mode LOC3 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC4             0x00000004UL                           /**< Mode LOC4 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC5             0x00000005UL                           /**< Mode LOC5 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_RXLOC_LOC6             0x00000006UL                           /**< Mode LOC6 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC0              (_UART_ROUTELOC0_RXLOC_LOC0 << 0)      /**< Shifted mode LOC0 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_DEFAULT           (_UART_ROUTELOC0_RXLOC_DEFAULT << 0)   /**< Shifted mode DEFAULT for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC1              (_UART_ROUTELOC0_RXLOC_LOC1 << 0)      /**< Shifted mode LOC1 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC2              (_UART_ROUTELOC0_RXLOC_LOC2 << 0)      /**< Shifted mode LOC2 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC3              (_UART_ROUTELOC0_RXLOC_LOC3 << 0)      /**< Shifted mode LOC3 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC4              (_UART_ROUTELOC0_RXLOC_LOC4 << 0)      /**< Shifted mode LOC4 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC5              (_UART_ROUTELOC0_RXLOC_LOC5 << 0)      /**< Shifted mode LOC5 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_RXLOC_LOC6              (_UART_ROUTELOC0_RXLOC_LOC6 << 0)      /**< Shifted mode LOC6 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_SHIFT            8                                      /**< Shift value for USART_TXLOC */
#define _UART_ROUTELOC0_TXLOC_MASK             0x700UL                                /**< Bit mask for USART_TXLOC */
#define _UART_ROUTELOC0_TXLOC_LOC0             0x00000000UL                           /**< Mode LOC0 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC1             0x00000001UL                           /**< Mode LOC1 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC2             0x00000002UL                           /**< Mode LOC2 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC3             0x00000003UL                           /**< Mode LOC3 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC4             0x00000004UL                           /**< Mode LOC4 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC5             0x00000005UL                           /**< Mode LOC5 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_TXLOC_LOC6             0x00000006UL                           /**< Mode LOC6 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC0              (_UART_ROUTELOC0_TXLOC_LOC0 << 8)      /**< Shifted mode LOC0 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_DEFAULT           (_UART_ROUTELOC0_TXLOC_DEFAULT << 8)   /**< Shifted mode DEFAULT for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC1              (_UART_ROUTELOC0_TXLOC_LOC1 << 8)      /**< Shifted mode LOC1 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC2              (_UART_ROUTELOC0_TXLOC_LOC2 << 8)      /**< Shifted mode LOC2 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC3              (_UART_ROUTELOC0_TXLOC_LOC3 << 8)      /**< Shifted mode LOC3 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC4              (_UART_ROUTELOC0_TXLOC_LOC4 << 8)      /**< Shifted mode LOC4 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC5              (_UART_ROUTELOC0_TXLOC_LOC5 << 8)      /**< Shifted mode LOC5 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_TXLOC_LOC6              (_UART_ROUTELOC0_TXLOC_LOC6 << 8)      /**< Shifted mode LOC6 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_SHIFT            16                                     /**< Shift value for USART_CSLOC */
#define _UART_ROUTELOC0_CSLOC_MASK             0x70000UL                              /**< Bit mask for USART_CSLOC */
#define _UART_ROUTELOC0_CSLOC_LOC0             0x00000000UL                           /**< Mode LOC0 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC1             0x00000001UL                           /**< Mode LOC1 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC2             0x00000002UL                           /**< Mode LOC2 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC3             0x00000003UL                           /**< Mode LOC3 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC4             0x00000004UL                           /**< Mode LOC4 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC5             0x00000005UL                           /**< Mode LOC5 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CSLOC_LOC6             0x00000006UL                           /**< Mode LOC6 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC0              (_UART_ROUTELOC0_CSLOC_LOC0 << 16)     /**< Shifted mode LOC0 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_DEFAULT           (_UART_ROUTELOC0_CSLOC_DEFAULT << 16)  /**< Shifted mode DEFAULT for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC1              (_UART_ROUTELOC0_CSLOC_LOC1 << 16)     /**< Shifted mode LOC1 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC2              (_UART_ROUTELOC0_CSLOC_LOC2 << 16)     /**< Shifted mode LOC2 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC3              (_UART_ROUTELOC0_CSLOC_LOC3 << 16)     /**< Shifted mode LOC3 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC4              (_UART_ROUTELOC0_CSLOC_LOC4 << 16)     /**< Shifted mode LOC4 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC5              (_UART_ROUTELOC0_CSLOC_LOC5 << 16)     /**< Shifted mode LOC5 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CSLOC_LOC6              (_UART_ROUTELOC0_CSLOC_LOC6 << 16)     /**< Shifted mode LOC6 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_SHIFT           24                                     /**< Shift value for USART_CLKLOC */
#define _UART_ROUTELOC0_CLKLOC_MASK            0x7000000UL                            /**< Bit mask for USART_CLKLOC */
#define _UART_ROUTELOC0_CLKLOC_LOC0            0x00000000UL                           /**< Mode LOC0 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_DEFAULT         0x00000000UL                           /**< Mode DEFAULT for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC1            0x00000001UL                           /**< Mode LOC1 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC2            0x00000002UL                           /**< Mode LOC2 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC3            0x00000003UL                           /**< Mode LOC3 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC4            0x00000004UL                           /**< Mode LOC4 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC5            0x00000005UL                           /**< Mode LOC5 for UART_ROUTELOC0 */
#define _UART_ROUTELOC0_CLKLOC_LOC6            0x00000006UL                           /**< Mode LOC6 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC0             (_UART_ROUTELOC0_CLKLOC_LOC0 << 24)    /**< Shifted mode LOC0 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_DEFAULT          (_UART_ROUTELOC0_CLKLOC_DEFAULT << 24) /**< Shifted mode DEFAULT for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC1             (_UART_ROUTELOC0_CLKLOC_LOC1 << 24)    /**< Shifted mode LOC1 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC2             (_UART_ROUTELOC0_CLKLOC_LOC2 << 24)    /**< Shifted mode LOC2 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC3             (_UART_ROUTELOC0_CLKLOC_LOC3 << 24)    /**< Shifted mode LOC3 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC4             (_UART_ROUTELOC0_CLKLOC_LOC4 << 24)    /**< Shifted mode LOC4 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC5             (_UART_ROUTELOC0_CLKLOC_LOC5 << 24)    /**< Shifted mode LOC5 for UART_ROUTELOC0 */
#define UART_ROUTELOC0_CLKLOC_LOC6             (_UART_ROUTELOC0_CLKLOC_LOC6 << 24)    /**< Shifted mode LOC6 for UART_ROUTELOC0 */

