RIOT-OS/RIOT/cpu/efm32/families/efm32gg11b/include/vendor/efm32gg11b_uart.h
/* Bit fields for UART ROUTELOC1 */
#define _UART_ROUTELOC1_RESETVALUE             0x00000000UL                          /**< Default value for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_MASK                   0x00000707UL                          /**< Mask for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_SHIFT           0                                     /**< Shift value for USART_CTSLOC */
#define _UART_ROUTELOC1_CTSLOC_MASK            0x7UL                                 /**< Bit mask for USART_CTSLOC */
#define _UART_ROUTELOC1_CTSLOC_LOC0            0x00000000UL                          /**< Mode LOC0 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC1            0x00000001UL                          /**< Mode LOC1 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC2            0x00000002UL                          /**< Mode LOC2 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC3            0x00000003UL                          /**< Mode LOC3 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC4            0x00000004UL                          /**< Mode LOC4 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC5            0x00000005UL                          /**< Mode LOC5 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_CTSLOC_LOC6            0x00000006UL                          /**< Mode LOC6 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC0             (_UART_ROUTELOC1_CTSLOC_LOC0 << 0)    /**< Shifted mode LOC0 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_DEFAULT          (_UART_ROUTELOC1_CTSLOC_DEFAULT << 0) /**< Shifted mode DEFAULT for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC1             (_UART_ROUTELOC1_CTSLOC_LOC1 << 0)    /**< Shifted mode LOC1 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC2             (_UART_ROUTELOC1_CTSLOC_LOC2 << 0)    /**< Shifted mode LOC2 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC3             (_UART_ROUTELOC1_CTSLOC_LOC3 << 0)    /**< Shifted mode LOC3 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC4             (_UART_ROUTELOC1_CTSLOC_LOC4 << 0)    /**< Shifted mode LOC4 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC5             (_UART_ROUTELOC1_CTSLOC_LOC5 << 0)    /**< Shifted mode LOC5 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_CTSLOC_LOC6             (_UART_ROUTELOC1_CTSLOC_LOC6 << 0)    /**< Shifted mode LOC6 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_SHIFT           8                                     /**< Shift value for USART_RTSLOC */
#define _UART_ROUTELOC1_RTSLOC_MASK            0x700UL                               /**< Bit mask for USART_RTSLOC */
#define _UART_ROUTELOC1_RTSLOC_LOC0            0x00000000UL                          /**< Mode LOC0 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_DEFAULT         0x00000000UL                          /**< Mode DEFAULT for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC1            0x00000001UL                          /**< Mode LOC1 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC2            0x00000002UL                          /**< Mode LOC2 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC3            0x00000003UL                          /**< Mode LOC3 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC4            0x00000004UL                          /**< Mode LOC4 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC5            0x00000005UL                          /**< Mode LOC5 for UART_ROUTELOC1 */
#define _UART_ROUTELOC1_RTSLOC_LOC6            0x00000006UL                          /**< Mode LOC6 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC0             (_UART_ROUTELOC1_RTSLOC_LOC0 << 8)    /**< Shifted mode LOC0 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_DEFAULT          (_UART_ROUTELOC1_RTSLOC_DEFAULT << 8) /**< Shifted mode DEFAULT for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC1             (_UART_ROUTELOC1_RTSLOC_LOC1 << 8)    /**< Shifted mode LOC1 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC2             (_UART_ROUTELOC1_RTSLOC_LOC2 << 8)    /**< Shifted mode LOC2 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC3             (_UART_ROUTELOC1_RTSLOC_LOC3 << 8)    /**< Shifted mode LOC3 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC4             (_UART_ROUTELOC1_RTSLOC_LOC4 << 8)    /**< Shifted mode LOC4 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC5             (_UART_ROUTELOC1_RTSLOC_LOC5 << 8)    /**< Shifted mode LOC5 for UART_ROUTELOC1 */
#define UART_ROUTELOC1_RTSLOC_LOC6             (_UART_ROUTELOC1_RTSLOC_LOC6 << 8)    /**< Shifted mode LOC6 for UART_ROUTELOC1 */

/** @} */
/** @} End of group EFM32GG11B_UART */
/** @} End of group Parts */
#ifdef __cplusplus
}
#endif

